[ { "name" : "Peter Poodle, by William Henry Bradley, A Project Gutenberg eBook", "image" : "cover.jpg", "description" : "The book tells the story of the toymaker Peter Poodle and two children, Tommy and Helen, in the magical town of Toyville.", "price" : "30.00" },
  { "name" : "The Project Gutenberg eBook of Patty's Pleasure Trip, by Carolyn Wells", "image" : "cover.jpg", "description" : "This story follows the adventures of Patty and her friends on a genuinely instructive and hilariously amusing pleasure trip from London to Paris, Rome, Florence and Venice.", "price" : "40.00" },
  { "name" : "The Project Gutenberg eBook of Philipp Reis_ Inventor of the Telephone, by Silvanus P. Thompson.", "image" : "i_frontis.jpg", "description" : "First Edition of what remains the only English-language biography of Philipp Reis, inventor of a telephone transmitter and receiver capable of reproducing music and-under certain circumstances-intelligible speech.", "price" : "50.00" },
  { "name" : "The Project Gutenberg eBook of The Joy of Life [La Joie de Vivre], by Emile Zola.", "image" : "cover.jpg", "description" : "The twelfth novel in the Rougon-Macquart series.", "price" : "33.00" },
  { "name" : "The Project Gutenberg eBook of The Magical Mimics in Oz, by Jack Snow.", "image" : "cover.jpg", "description" : "The thirty-seventh volume in the Oz book series.", "price" : "34.90" },
  { "name" : "The Project Gutenberg eBook of The Newspaper, by G. Binney Dibblee", "image" : "cover.jpg", "description" : "All about newspapers & journalism.", "price" : "10.00" },
  { "name" : "The Project Gutenberg eBook of The Sugar Creek Gang Digs for Treasure, by Paul Hutchens", "image" : "cover2.jpg", "description" : "A mysterious note in invisible ink leads the Sugar Creek Gang on a hunt for buried treasure. Is the key to the treasure in the weathered log house, or is it in the icehouse? Will the Gang have a run-in with the accomplice to the Ostberg kidnapping?", "price" : "66.70" },
  { "name" : "The Project Gutenberg eBook of The Sugar Creek Gang Goes North, by Paul Hutchens", "image" : "cover2.jpg", "description" : "The Sugar Creek Gang discovers a disguise hidden in a old tree. Does it belong to the bank robber hiding in the swamp? A mysterious map hidden near the tree proves to be even more exciting than the disguise.", "price" : "39.01" }]