[ { "bookname" : "Peter Poodle, by William Henry Bradley, A Project Gutenberg eBook", "nickname" : "Black Panther", "review" : "I would like to give this book three and a half stars, but that's not possible. I just couldn't give it four. I am the wrong age for this book, the target audience for this one should be those born in the mid-eighties, or perhaps later, but not any earlier. The dialogue and characters are very good in the beginning. It is well written. Those younger than mid-life will understand what the characters are saying and doing, but I had a hard time. Some of it is funny, just not enough. I have to be invested in the characters to fully enjoy a story, and I just wasn't with this one. If you were born in the mid-eighties or later, you'll probably enjoy this book.", "approved" : "yes"},
  { "bookname" : "Peter Poodle, by William Henry Bradley, A Project Gutenberg eBook", "nickname" : "The Rock", "review" : "Wow, this was a very intriguing start to a three part story. I have read reverse harem stories many times before but this one was very different but interesting and captivating. I liked all the characters for various reasons, and the fact that they were all onboard about their relationship from the get go. For me this story could go two ways and that’s where I get a little nervous because I love happy endings and not so keen on the angst, especially when it comes to frat boys because their hormones tend to rule their minds a lot of the time. So...although I loved book one, I am nervous about reading book two and what could possibly come with that. Great start of a three part. A copy was provided to me with no requirements for a review. I voluntarily read and reviewed this book with my honest opinion.", "approved" : "yes"},
  { "bookname" : "Peter Poodle, by William Henry Bradley, A Project Gutenberg eBook", "nickname" : "The Rock", "review" : "I read this book a couple years ago, but I still remember my general impression of it. In one word: Bleak. The writing is much better than so many writers one comes across these days, but the world it portrays is black and white and leaves one feeling heavy.", "approved" : "yes"},
  { "bookname" : "Peter Poodle, by William Henry Bradley, A Project Gutenberg eBook", "nickname" : "Iron Man", "review" : "This was a delightful, winsome little book detailing the sweet, gentle romance of Jennifer O'Malley with Tom Peterson, and her beginnings as a Christian. Having already read the O'Malley series, I knew and loved this character before reading this book. Still, this little novella somehow managed to make me love her even more.", "approved" : "yes"},
  { "bookname" : "Peter Poodle, by William Henry Bradley, A Project Gutenberg eBook", "nickname" : "Zarif", "review" : "Another book that made my to read list and I am not sure why. A series of arsons in a backwater Virginia county and town the type of Tidewater community that is literally and figuratively going under water. Global warming and the Chesapeake Bay. The author did a thorough, solid piece of writing in exploring the arsons and the two ultimately charged with the crime. As with most criminal duos, you read how it took those two varied personalities to meet and mesh to create the mess that they did for the community and law enforcement officials at many levels. An expensive exercise for the disaffected in society.", "approved" : "yes"},
  { "bookname" : "Peter Poodle, by William Henry Bradley, A Project Gutenberg eBook", "nickname" : "Ben hadofek", "review" : "Short children's book about women in science but it was fascinating. I learned about several women I had never even heard of and that interested me enough to seek out full length books about them. I recommend this book as a great starting point for those wanting to learn more about this subject.", "approved" : "yes"},
  { "bookname" : "Peter Poodle, by William Henry Bradley, A Project Gutenberg eBook", "nickname" : "Mr. President", "review" : "I really enjoyed this book. The only negative would be how many times the h told herself she had to do everything alone, but since she wasn't screaming, or throwing tantrums, and she accepted help when it was critical, it was okay. The supporting characters were interesting, especially the brothers, and I hope we see them again soon!", "approved" : "yes"},
  { "bookname" : "Peter Poodle, by William Henry Bradley, A Project Gutenberg eBook", "nickname" : "Deadpool", "review" : "The original Marvel Team Up is my favorite comic ever. The ridiculous serendipity that would pull different, unconnected heroes together each month let you speed date new characters and the stand alone format made it the perfect grocery store pick up for young, broke readers. This titles feels like a throwback to that and while it's far from perfect it is a pleasant ride and fun to watch probably the two most different characters in the Marvel Universe bounce off each other.", "approved" : "yes"},
  { "bookname" : "Peter Poodle, by William Henry Bradley, A Project Gutenberg eBook", "nickname" : "Gigi", "review" : "I try not to review big hardbacks and table books like this one, but I've read it a couple of times already and really wanted to give it a shoutout - for its' many ace tips, beautiful photography, and practical bits and pieces of information that help me keep my plants happy. And also because the writers' enthusiasm is really growing on me, even though I must admit they seemed just a bit too eager at first. The title is a bit misleading - it's got a lot of tropical plants, and DIY planters/ wall hangers/ display ideas as well. There is a section on how to encourage kids to care for plants, which is also cool.", "approved" : "yes"},
  { "bookname" : "Peter Poodle, by William Henry Bradley, A Project Gutenberg eBook", "nickname" : "King of pop", "review" : "Intelligent. Pertinent. Practical. Provided cuts through the thick of a much-irksome matter to dispel the tragic lie that God is stingy or churlish. Using his craft of storytelling and theological prowess, Dr. Quek reveals beautifully that our provision is no fairy tale affair spritzed with a little false hope here and a broken dream there. Really, and oh-so-convincingly, provision’s a done deal!", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of Patty's Pleasure Trip, by Carolyn Wells", "nickname" : "Black Panther", "review" : "What a wonderful and fun addition to the Grim Sinners series. This book was so worth the wait. LeAnn is a marvelous writer and I am always beyond satisfied after reading one of her books. She always makes them fun and I am always enthralled through the whole book. And man the endings she writes with her books make my heart happy.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of Patty's Pleasure Trip, by Carolyn Wells", "nickname" : "Black Panther", "review" : "I had never heard of Kelly Corrigan. But I was encouraged to read this book of personal essays when I saw GR friend JanB’s lovely review that described reading Tell Me More as sitting down to talk with a close friend. At the core of the each chapter is Corrigan’s grief over the recent loss of her father and a close friend. But throughout the book there are many anecdotes and lots of relatable self reflections about being a parent, a partner, a daughter, a sibling and a friend. In an understated way, Corrigan dwells on what it means to strive for a good life — or a good enough life. Corrigan doesn’t offer any trite answers, which is precisely what makes her seem very human or like someone you would want as a friend. It’s short but well worth reading. Thanks to Netgalley and the publisher for an opportunity to read an advance copy.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of Patty's Pleasure Trip, by Carolyn Wells", "nickname" : "The Rock", "review" : "I just love the way Kelly Corrigan writes. Her sentences have warmth, humor, truth and feeling. I felt much during this audiobook and even cried a few times. I think Kelly makes me cry during every book she has read to me. Kelly writes of her grief over her fathers death as well as her young friend Liz. Mothers especially will appreciate this book.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of Patty's Pleasure Trip, by Carolyn Wells", "nickname" : "Bruce Banner", "review" : "While I would not have normally read this autobiography I am so glad I did. I loved the heart felt way that the author places it all out there for us to do with as we will. I would not really have considered this a self help book until I realized that it had done more for me than most of the people in my life. I would like to take the time to thank the author for that.", "approved" : "no"},
  { "bookname" : "The Project Gutenberg eBook of Patty's Pleasure Trip, by Carolyn Wells", "nickname" : "Wolverine", "review" : "This is a book I will return to again - dipping into chapters as I need to be reminded of the lessons Corrigan imparts. I want to give this to everyone on my Christmas list but alas it comes out in January. This collection of beautiful essays about connecting with those you love and going onward is poignant, funny and heart wrenching. I had moments where I had to stop and pause and say EXACTLY as I marveled how Corrigan was so aptly able to describe a particular circumstance of the human condition.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of Patty's Pleasure Trip, by Carolyn Wells", "nickname" : "Zarif", "review" : "I appreciate Kelly Corrigan's honesty. She captures common experiences and emotions and elevates them into a larger conversation. Even though the book is filled with stories from her life, the reader can find themselves in the truth of the struggle, joy and absurdity of Life.The chapters about the phrases, Tell Me More and No Words at All got me on a gut level. Corrigan sets aside a willingness to be seen as having it all together so that we all can grow and be better. Thank you!", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of Patty's Pleasure Trip, by Carolyn Wells", "nickname" : "Ben hadofek", "review" : "This book was often lighter than I expected, but still moving and poignant. The 12 phrases the author used as chapter titles are heartfelt and simple ways to keep a conversation moving or to take it deeper. The author does she good job of weaving in stories if her own experiences with life and loss in a way that isn't heavy handed, but filled with grace and honest. It was a good read.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of Patty's Pleasure Trip, by Carolyn Wells", "nickname" : "Deadpool", "review" : "Read it in one day because Kelly is just so relatable. So incredibly relatable. I love that she doesn’t try to come across as a literary genius by writing with big words or flowery prose. She is who she is & she’s amazingly comfortable with that and I love that. This actually made me want to go back and read her other books soon!", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of Philipp Reis_ Inventor of the Telephone, by Silvanus P. Thompson.", "nickname" : "Black Panther", "review" : "Waste of time, especially when there's massive cursing in the first few chapters alone. Not sure what I was supposed to glean from someone who talks this way to (or about) her family. After several tries, I didn't bother finishing it.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of Philipp Reis_ Inventor of the Telephone, by Silvanus P. Thompson.", "nickname" : "Black Panther", "review" : "True account of Yemen-American. When he learns that coffee originated in Yemen, he employs passion, courage, creativity, & humanitarianism to make Yemen coffee the world's best. All that amid daunting poverty, war & politics. Pulitzer prize author. Audio narrator passable, but not a quite right fit & mispronounced eide. Story was engaging all the same.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of Philipp Reis_ Inventor of the Telephone, by Silvanus P. Thompson.", "nickname" : "The Rock", "review" : "This book was a perfect combination of two things that truly give me joy in this world - reading and drinking coffee! I will never look at a cuppa java in the same way again, (nor complain about the price!) now that I know so much more than I did just last week, about the journey coffee beans take to get to me for my daily 'simple pleasure' enjoyment. David Eggers is such a gifted writer, and boy, did he do justice to the subject matter here. I am in awe of his dedication to research and detail, as well as his ability to craft whatever subject he chooses to write about, into a page-turning thriller. Thank you so much for bringing the Monk of Mokha's story to us!", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of Philipp Reis_ Inventor of the Telephone, by Silvanus P. Thompson.", "nickname" : "Iron Man", "review" : "I wanted to like this book! I should have liked this book! I grew up going to my grandparents coffee plantation, eating the beans, watching the picking, the pealing, the drying, the sorting.... My brother in law still owns a coffee plantation... The book even dealt with events that are in my recent memory! It was engaging especially at the beginning and some of it was entertaining. Yet it lacked humanness. It felt like I was watching the news. In my opinion, not Dave Eggers at his best.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of Philipp Reis_ Inventor of the Telephone, by Silvanus P. Thompson.", "nickname" : "Wonder Woman", "review" : "This is a wonderful story about a Yemeni-American kid from San Francisco’s Tenderloin who beats the odds and makes it as an importer of coffee from his ancestral home in the middle of a civil war. Horatio Alger, eat your heart out.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of Philipp Reis_ Inventor of the Telephone, by Silvanus P. Thompson.", "nickname" : "Wonder Woman", "review" : "Super enthralling, vivid storytelling with a heartwarming immigrant hero, and the dramatic backdrop of Yemen — a fascinating country anytime, but even more than usual now. I’m a former Peace Corps volunteer who served in Yemen in the late 70’s so I was of course drawn to the story for that reason, and the book does capture some of the things that make Yemen so amazing— rugged friendly people, stunning landscapes, the national habit of chewing qat, and lots of oddball craziness.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of Philipp Reis_ Inventor of the Telephone, by Silvanus P. Thompson.", "nickname" : "Mr. President", "review" : "4.5 for this novel centered around 4 siblings in New York. It’s 1969, these Jewish siblings ages 13-7, two boys and two girls, hear on the street that there is a woman in the city who can tell fortunes. They visit her and she sees them one at a time, and tells them the date they will die.So we follow these kids through the years and see how this information changes the way they live and their relationships with their family and others. I really enjoyed this book!", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of Philipp Reis_ Inventor of the Telephone, by Silvanus P. Thompson.", "nickname" : "Mr. President", "review" : "I thought that this was going to be magical realism which I confess is not a subgenre that I enjoy. It isn't. Four siblings, as children, find out the date of their deaths and for the next fifty years their lives richochet about as they try to live with (or run from)this knowledge. The Immortalists is about life, the bonds between siblings as well as science, religion, dance and research monkeys. Yes, you read that correctly.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of Philipp Reis_ Inventor of the Telephone, by Silvanus P. Thompson.", "nickname" : "King of pop", "review" : "This was heartbreaking. This was beautiful. This story needed to be told. I will never forget these characters, this town, this book, this story, these emotions I felt while reading it. That's all I can process right now.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Joy of Life [La Joie de Vivre], by Emile Zola.", "nickname" : "Black Panther", "review" : "Monica Murphy killed it with her new ya thriller! She had me dying to know who the killer/ killers were throughout the entire book. I really enjoyed the suspense and as usual Monica delivers high school drama perfectly.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Joy of Life [La Joie de Vivre], by Emile Zola.", "nickname" : "Black Panther", "review" : "I tend to enjoy YA thrillers because they lack the graphicness of their adult counterparts. I couldn't resist after seeing this synopsis on NetGalley. Despite the interesting premise, it was difficult for me to truly enjoy the storyline because of my dislike for the main character. I failed to appreciate the appeal of the mean girl Penelope, and my feelings never changed throughout the book. I found her shallow and immature, and she never seemed to develop despite trying to solve murders.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Joy of Life [La Joie de Vivre], by Emile Zola.", "nickname" : "Iron Man", "review" : "What an amazing and sad and important book! I was entranced by Nadia’s story, and I learned more about the events in Syria than I’d known before. I feel so lucky that I was able to meet the author and get an ARC of the book for my class.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Joy of Life [La Joie de Vivre], by Emile Zola.", "nickname" : "Wolverine", "review" : "Twelve year old Syrian, Nadia along with her family try to flee Aleppo before the anti-government protesters break out and bombs start to fall. It's too late, and her family fear that Nadia did not survive an air raid. Here is her journey, traveling through a war torn country in hopes to reconnect with her loved ones; along the way finding friendship and unearthing Syria's rich history and rediscovering the culture of her people.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Joy of Life [La Joie de Vivre], by Emile Zola.", "nickname" : "Queen B", "review" : "This riveting tale follows a girl hoping to make her way out of war-torn Syria. I particularly appreciated the references to the area's history. The author deftly handled the youth perspective of the conflict's beginnings.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Joy of Life [La Joie de Vivre], by Emile Zola.", "nickname" : "Queen B", "review" : "A very balanced look into one of the tragedies of our time. A story of personal growth, aging beyond years, the terrible effects of war and the hope despite all evidence to the contrary that there is the possibility of something better. It should be mandatory reading for our leaders, but also for all of us.", "approved" : "no"},
  { "bookname" : "The Project Gutenberg eBook of The Joy of Life [La Joie de Vivre], by Emile Zola.", "nickname" : "Lukaku", "review" : "Outstanding! I felt like I was there alongside Nadia and her frightening journey. The characters are well developed and I feel that I have a deeper understanding of the situation in Syria. This is a must read for early 2018.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Joy of Life [La Joie de Vivre], by Emile Zola.", "nickname" : "Shelly", "review" : "Another hit with this one! Loved the character development of Rosa Lee! I have so many questions about Ma Pearl after this one! Would love her perspective and maybe it will explain her Behavior. Hope to see a book 3!!", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Magical Mimics in Oz, by Jack Snow.", "nickname" : "The Rock", "review" : "Loved, loved this book! I read the first book, Midnight Without a Moon, in this series. I felt Rose was strong, but I love how Jackson made her an even stronger person in this book. I absolutely loved Midnight Without a Moon, but I had a few fellow teachers express their concerns about reading it aloud to their students due to the graphic detail of the killing of Emmitt Till and the pregnancy of Rose's cousin. This book provides a window into the hate African-Americans endured during the Jim Crow Law years without the detailing of a killing. It would be a safer book for teachers to read aloud to their students without a parent becoming upset. This book is not any less of a book than MWaM, but those considering read alouds to students, this is the better choice.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Magical Mimics in Oz, by Jack Snow.", "nickname" : "The Rock", "review" : "Rose Carter is one of those characters who you know is going to go on and do amazing things with her life. I loved Rose in Midnight Without a Moon, and I am so glad that Linda Jackson continued with Rose's story in A Sky Full of Stars. The civil rights era captures my students' attention, and this book will continue to teach them what a difficult time period it was. I can't wait to purchase this one to place on the shelf along with Midnight Without a Moon.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Magical Mimics in Oz, by Jack Snow.", "nickname" : "Wonder Woman", "review" : "As was Midnight Without a Moon, A Sky Full of Stars is beautifully written. Picking up immediately where book one left off, Rosa Lee remains in Stillwater rather than taking her Aunt Belle up on the offer to join her and Monty is St. Louis. But it doesn't come at a cost. Rosa struggles with how to be a voice and demonstrator, something she and Hallelujah want her to be. But she knows Ma Pearl wouldn't approve. Not to mention, there's the fear of being hurt or killed, because Negro people are losing their lives more often for no good reason. While I desperately wanted Rosa to move north and achieve something greater, I absolutely loved how Linda Williams Jackson wrote her internal conflict. It was so authentic. This is the middle grade historical fiction I've always been a fan of.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Magical Mimics in Oz, by Jack Snow.", "nickname" : "Wonder Woman", "review" : "I was really excited to read this one after loving Midnight Without A Moon. And my excitement was validated as I jumped right back into the life of Rosa in 1950s Mississippi. Linda has such a way with words and I fell instantly into the heartbreak and pain of the community. A story filled with both hope and defeat, love and loss. I hope many students have the opportunity to see this part of our dark & terrifying history through Rosa's eyes.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Magical Mimics in Oz, by Jack Snow.", "nickname" : "Bruno Mars", "review" : "A Sky Full of Stars is a historical Fiction piece by Linda Williams Jackson. I enjoyed it because the book shows a different way of seeing the Civil Rights Movement. Rosa Carter Lee is contemplating whether she should move up North, or if she should stay. She faces different views of her fellow African American students, from Shorty, her cousin who wants to see the white people in fear as the African Americans were facing, to Hallelujah, Rosa's best friend, who just want peace.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Magical Mimics in Oz, by Jack Snow.", "nickname" : "Bruno Mars", "review" : "This is a hard book - it does not pull back on the brutality of slavery and slave catching even though this is a children's book. But it's so so good! Charlie is a character you have to root for. I used to say that Brian Jaques' Cluny the Scourge was just about the most loathsome villain in children's literature. But he has nothing on Cap'n Jack.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Magical Mimics in Oz, by Jack Snow.", "nickname" : "Gigi", "review" : "I have always said I would gladly read anything by Christopher Paul Curtis, but the dialect in this book is just too much of a stumbling block for me and I decided to abandon the ARC after the first chapter. Reading dialect feels very tedious to me, and trying to read it aloud just made me sound foolish. I will consider revisiting the story as an audiobook in the future.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Magical Mimics in Oz, by Jack Snow.", "nickname" : "Gigi", "review" : "Charlie's story arc is at times predictable, but still moving. It's satisfying to see him slowly figure out what is really going on and wrestle with his conscious. Excellent author's note from Curtis, as usual. The dialect will keep kids from flocking to this, but its use is authentic and effective.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Newspaper, by G. Binney Dibblee", "nickname" : "Black Panther", "review" : "Fantastic middle-grade historical fiction with lessons that resonate loudly today. The past is not prettied up, it’s shown in ugly truth.. The protagonist is not purely good or purely evil, he’s complicated and conflicted, just like the readers. Youth will be able to question how they would have acted or responded in Charlie’s position. Excellent.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Newspaper, by G. Binney Dibblee", "nickname" : "Black Panther", "review" : "Gripping historical fiction story that looks at slavery, specifically how the Fugitive Slave Law impacted slaves who had even escaped to Canada. Curtis has created characters that will stick with you and a story that shares an important part of history.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Newspaper, by G. Binney Dibblee", "nickname" : "Bruce Banner", "review" : "Dirt poor and desperate twelve-year-old sharecropper Charlie gets tricked by the nearby plantation's overseer into leaving South Carolina to go to Detroit and then Canada to retrieve some property and comes face to face with the evils of the Fugitive Slave Act.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Newspaper, by G. Binney Dibblee", "nickname" : "Bruce Banner", "review" : "I have read every Hamster Princess book and still enjoy the unconventional princess. Harriet is fun, brave, and would rather cliff dive than go to a ball. These books are quick reads with fun illustrations throughout that also break up the text for even the most reluctant readers. I recommend these books, which don't have to be read in order of publication to get to know Harriet and her friends, family, and beloved quail.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Newspaper, by G. Binney Dibblee", "nickname" : "Refaeli", "review" : "Another great adventure with Princess Harriet Hamsterbone! In this, she must help undo a fairy's gift to Ella, who doesn't actually want to go to the ball and meet a prince. Full of the same clever writing and witty commentary, this is a must read for fans of the series. Highly recommended for grades one and up.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Newspaper, by G. Binney Dibblee", "nickname" : "Refaeli", "review" : "I still love Harriet Hamsterbone. I love how she suffers through her role as Princess, but understands that isn't a something for everyone. Happily ever afters cannot be mandated or manufactured for you. You have to make that happen on your own. No one should wish for a Fairy Godmother to save them. Follow Harriet's lead, and save yourself.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Newspaper, by G. Binney Dibblee", "nickname" : "Deadpool", "review" : "Nonconformist, butt-kicking princess genre meets cute animal graphic hybrids. Princess Harriet is a charming, assertive, cliff-diving hamster princess who sets out to free Whiskerella from the unwanted spell of her fairy godmouse in an upending of the traditional story. Good humor in places. Great for fans of Babymouse, Princess in Black, and the like.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Newspaper, by G. Binney Dibblee", "nickname" : "Deadpool", "review" : "While I would love to give this a more in-depth review, I'll be succinct in saying it was incredible to see Pendergast in this new light, and I await everyone's reactions to the ending. His cloak of invincibility is threadbare and fraying.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Newspaper, by G. Binney Dibblee", "nickname" : "Alexandra", "review" : "A straightforward mystery that could easily be read as a standalone. That said, Pendergast fans may be disappointed that there is no character development to further the series along. There is a murderer who is beheading extremely wealthy victims and police are at a loss. There are political undercurrents featuring the wealthy vs. the nots. A satisfying read.", "approved" : "no"},
  { "bookname" : "The Project Gutenberg eBook of The Sugar Creek Gang Digs for Treasure, by Paul Hutchens", "nickname" : "Iron Man", "review" : "I love A.X.L. Pendergast! This is the 17th book in the series, and I've thoroughly enjoyed them all. This one has a particularly exciting and suspenseful ending. Plus an intriguing epilogue. I'm eagerly looking forward to the next installment of this fascinating series.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Sugar Creek Gang Digs for Treasure, by Paul Hutchens", "nickname" : "Iron Man", "review" : "I was fortunate enough to receive an Advance Review Copy of this novel which comes out next year. Fans of Murakami will not be disappointed by this lyrical, spell-binding evocation of a narrator who finds himself alone and grieving in a sleepy Japanese town. I lost myself in Goenawan’s prose, in the effortless detail of everyday life and in the brooding mood that hung over every action.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Sugar Creek Gang Digs for Treasure, by Paul Hutchens", "nickname" : "The Maestro", "review" : "A quietly wonderful literary family mystery set in a small town in Japan, this is a debut that I am SO happy I had the chance to read early. This is NOT a thriller or a fast-paced suspense story. It IS an incredibly thoughtful and spare story with hints of magical realism. Thanks to the publisher for the digital advance copy!", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Sugar Creek Gang Digs for Treasure, by Paul Hutchens", "nickname" : "The Maestro", "review" : "Rainbirds is a story about grief, and the lengths we will go through to resolve it. Goenawan writes with precise beauty, as we follow a brother intent on saying goodbye to a beloved sister who died too soon. Equal parts sinister and heartbreaking, Rainbirds will stay with you long after you read the final page. This is a must read for 2018!", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Sugar Creek Gang Digs for Treasure, by Paul Hutchens", "nickname" : "Ibra", "review" : "Clarissa Goenawan’s Rainbirds is a literary fiction which will draw you in right away. It's a story of sister's grief set in Japan. There is a mystery, magical realism, dreams, interesting characters, a ghost story. It will keep you wondering what's going on, while appreciating the poetry of the author's prose. The writing is truly magical.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Sugar Creek Gang Digs for Treasure, by Paul Hutchens", "nickname" : "Lukaku", "review" : "What a profound read. Filled with the subtle layers of grief, RAINBIRDS hypnotized me. A touch of mystery regarding Keiko's death gave the plot an ending point, but for me, this story is about Ren. His quiet strength and deep love for his sister created made him easy to connect to, and I fell into the sparse, elegant prose. Overall, I took my time with this one and I'm happy I did as RAINBIRDS isn't a book to be rushed.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Sugar Creek Gang Digs for Treasure, by Paul Hutchens", "nickname" : "Lukaku", "review" : "Really a truly wonderful book. Wonderful, make you feel good kinda story. So many laughs, a few tears. You end up liking Graces family (you want to be a part of her family!), even her dad, yikes. And the music wow :)!! Loved the writing, so many of it will definitely stay with me.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Sugar Creek Gang Digs for Treasure, by Paul Hutchens", "nickname" : "Alexandra", "review" : "I have fallen in love with the heroine of This I Know-by Eldonna Edwards. I was so very lucky to receive an advanced copy. Grace Carter will be with me-maybe always. I loved this book. Everyone add it to your lists or pre order. It is That good.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Sugar Creek Gang Digs for Treasure, by Paul Hutchens", "nickname" : "Alexandra", "review" : "This book started out pretty well and then it took a sharp left into DNF territory which encompasses; predictable, boring and annoying. I didn't like any of the characters aside from the grandfather whose nonchalant attitude matched my own towards the book.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Sugar Creek Gang Goes North, by Paul Hutchens", "nickname" : "Iron Man", "review" : "Ah, this book is so close to home (literally and figuratively) in so many ways. The plot, of course, is fictional, but many of the elements, even the town, drew liberally from my formative years. The ability to combine my favorite things -- fiction and music -- has been sublime. What a singular joy this experience has been.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Sugar Creek Gang Goes North, by Paul Hutchens", "nickname" : "Iron Man", "review" : "If you're like me, you thought the last 3 volumes were mediocre at best. I collected all the single issues and literally read this in one sitting over again. I am happy to say, THIS IS THE AQUAMAN STORY WE HAVE ALL BEEN WAITING FOR!!!!", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Sugar Creek Gang Goes North, by Paul Hutchens", "nickname" : "Ibra", "review" : "Female Thor spends yet another volume preaching that fighting is bad and contemplating if being alive is really worth it. Odinson remains in a stagnant love triangle. Malekith continues to brood over the “War of Realms” that never seems to come. The story has not moved one smallest bit since The God of Thunder arc ended six volumes ago. Just end this female Thor nonsense and re-focus on actual storytelling. The Generations comic is the highlight here.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Sugar Creek Gang Goes North, by Paul Hutchens", "nickname" : "Ibra", "review" : "Better than the previous volume, but the war is still moving pretty slowly. Unlike many here, I enjoyed Jane's solution to the problem of the War Thor, and I like how she's wrestling with the concept of self and how to live out her remaining days, but I am about ready for her to be cured. Unless it means she gives up Mjolnir.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Sugar Creek Gang Goes North, by Paul Hutchens", "nickname" : "Alexandra", "review" : "Uppercase never disappoints! another great book that helped me to step outside of my comfort zone. The mystery that picked up on 169 and the romance aspect was so intriguing . I will definitely be recommending this to anyone ( i have a copy if anyone would like to borrow it). Thanks Uppercase!", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Sugar Creek Gang Goes North, by Paul Hutchens", "nickname" : "Alexandra", "review" : "I wanted to like this one but at times it reminded me of avatar . I liked that there was a good of friends who solved the mystery. I also liked the questions were answered right away so not to leave the reader hanging. I do want to see what happens next in this series.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Sugar Creek Gang Goes North, by Paul Hutchens", "nickname" : "King of pop", "review" : "Science fiction, still not my go-to genre, but this was a story I could follow. I appreciate the additional info from the UppercaseBox book experienceJanuary2018. Interesting themes of human and nature camouflage and crossing boundaries and taking liberties disrespecting what already exists", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Sugar Creek Gang Goes North, by Paul Hutchens", "nickname" : "King of pop", "review" : "The first half was kind of slow... But I get it... Works building and all that. It definitely picked up a lot half way through. I'm impressed with the authors imagination because she made up a whole new world with plants and animals that are unlike anything in the real world. Pretty impressive! Think Avatar. It's a lot like that.", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Sugar Creek Gang Goes North, by Paul Hutchens", "nickname" : "Shelly", "review" : "The ONLY reason I didn’t give this a 5 Star rating is because of the slow build up. There was a lull for a good chunk in the middle where I thought “so... is something going to happen? Are we going to SEE Faloiv or it’s people!?” But the overall was great. I loved this and absolutely can not wait for the sequel!", "approved" : "yes"},
  { "bookname" : "The Project Gutenberg eBook of The Sugar Creek Gang Goes North, by Paul Hutchens", "nickname" : "Shelly", "review" : "Cole has crafted a beautiful world in A Conspiracy of Stars. She took the time to describe life on Faloiv and in N’Terra, which endeared me to the story and the characters. The mystery pushed me to keep reading well into the night and the pay-off is so satisfying. I eagerly await the next book, and I plan to share this powerful story with many others.", "approved" : "yes"}]